// 自己家没有this 就去上一级寻找。

// 两处代码相同
// let a = b => b+1 //去掉function 关键字，
function a(b) {
    return function (c) {
        return b+c;
    };
}

let aa = b => c => b+c;

var aaa = b =>c => b+c;
//高阶函数
console.log(aa(1)(2))
console.log(aaa(1)(2))
/*
===============================================
=====================注释区=====================
=====================注释区=====================
=====================注释区=====================
===============================================

在vue中很多时候不能使用箭头函数。/

三大

 */